/**
Συμπληρώστε το ακόλουθο C++ πρόγραμμα:
*/
#include <iostream>
using namespace std;

/* Προσθέτει 2 αριθμούς και επιστρέφει το αποτέλεσμα */
int add(int x, int y) {
    // Προσθέστε C++ κώδικα
}

/* Αντιστρέφει τις τιμές δύο μεταβλητών με χρήση δεικτών */
void swap(int *x, int *y) {
    int temp;
    // Προσθέστε C++ κώδικα
}

// Μειώνει κατά ένα την τιμή του x – χρήση αναφοράς
void dec(int &x) {
    // Προσθέστε C++ κώδικα
}

// Αυξάνει κατά ένα την τιμή του x – χρήση αναφοράς
void inc(int &x) {
    // Προσθέστε C++ κώδικα
}

int main() {
    /* Προσθέστε τον απαραίτητο C++ κώδικα που να επιδεικνύει την χρήση
       όλων των παραπάνω συναρτήσεων */
	   
	     /* Προσθέστε τον απαραίτητο C++ κώδικα που να επιδεικνύει την χρήση
     όλων των παραπάνω συναρτήσεων */
	int x = 3, y = 7;

    cout << "Test add() " << endl
         << "x + y = " << x << " + " << y << " = " << add(x,y) << "\n\n";

    cout << "Test swap()" << endl
         << "(x, y) before: " << x << ", " << y << "\n";
         
    swap(&x,&y);
    
    cout << "(x, y)  after: " << x << ", " << y << "\n\n";

    cout << "Test dec() on x" << endl;
    dec(x);
    cout << "x = " << x << "\n\n";

    cout << "Test inc on y" << endl;
    inc(y);
    cout << "y = " << y << endl;

    return 0;

}